In [13]:
import pandas as pd

df = pd.read_csv("stats_batting_1.csv")
df.head()

,player_name,runs_scored,balls_faced,times_out,batting_average,strike_rate
0,A Ashish Reddy,280,193,15,18.67,145.08
1,A Chandila,4,7,0,NaN,57.14
2,A Chopra,53,71,6,8.83,74.65
3,A Choudhary,25,20,1,25.00,125.00
4,A Dananjaya,4,5,0,NaN,80.00

In [19]:
df.columns

Index(['player_name', 'runs_scored', 'balls_faced', 'times_out',
       'batting_average', 'strike_rate'],
      dtype='object')

In [25]:
df.drop(columns=['runs_scored','times_out','balls_faced'],inplace=True)

In [26]:
df.to_csv('stats_batting_2.csv',index=False)

In [27]:
df.head()

      player_name  batting_average  strike_rate
0  A Ashish Reddy            18.67       145.08
1      A Chandila              NaN        57.14
2        A Chopra             8.83        74.65
3     A Choudhary            25.00       125.00
4     A Dananjaya              NaN        80.00